src/Documents/ПриказОЗачисленииНаКурс/ПриказОЗачисленииНаКурс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОЗачисленииНаКурс</name>
  <attributes>
    <name>Программа</name>
    <type>
      <types>CatalogRef.УчебныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОргПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОргПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектПриказаВноситДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроектПриказаВносит</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано1Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано1</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано2Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано2</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПриказОЗачисленииНаКурс/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	Объект.ПодписантДолжность = ПолучитьШаблонДолжностиНаСервере(Объект.Подписант);

КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонДолжностиНаСервере(ФИО)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Ссылка", ФИО);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ДолжностьШаблон КАК ДолжностьШаблон
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДолжностьШаблон;  
    КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПроектПриказаВноситПриИзменении(Элемент)
	
	Объект.ПроектПриказаВноситДолжность = ПолучитьШаблонДолжностиНаСервере(Объект.ПроектПриказаВносит);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано1ПриИзменении(Элемент)
	
	Объект.Согласовано1Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано1);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано2ПриИзменении(Элемент)
	
	Объект.Согласовано2Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано2);
	
КонецПроцедуры
